In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/raw_sales.csv")
df.head()

         Date  Sales
0  2018-01-01    450
1  2018-01-02    470
2  2018-01-03    465

In [3]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    3 non-null      datetime64[ns]
 1   Sales   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 180.0 bytes

In [4]:
df = df.sort_values('Date')
df.head()

        Date  Sales
0 2018-01-01    450
1 2018-01-02    470
2 2018-01-03    465

In [5]:
df.isnull().sum()

Date     0
Sales    0
dtype: int64

In [8]:
df['Sales'] = df['Sales'].ffill()
df.head()

        Date  Sales
0 2018-01-01    450
1 2018-01-02    470
2 2018-01-03    465

In [7]:
df = df.drop_duplicates()
df.head()

        Date  Sales
0 2018-01-01    450
1 2018-01-02    470
2 2018-01-03    465

In [9]:
daily_sales = df.groupby('Date')['Sales'].sum().reset_index()
daily_sales.head()

        Date  Sales
0 2018-01-01    450
1 2018-01-02    470
2 2018-01-03    465

In [10]:
daily_sales.to_csv("../data/cleaned_sales.csv", index=False)